// pages/WhatsNew/WhatsNew.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    new170:["调整登录方式为个人门户，请及时更新信息","修复挂科成绩无法显示的 bug","账号设置页面增加测试登录按钮","提升信息获取速度","逻辑优化","UI 调整"],
    new160: ["优化课程表显示","调整打开分享逻辑","点击课程可以显示时间重复的课程（滑动查看）","UI 调整"],
    new155: ["调整打开分享卡片的逻辑","修复一个恶性 bug","修复加载数据时逻辑错误"],
    new153: ["增加客服入口", "可通过右上角进行转发操作", "冷启动时主动检查更新", "UI 调整"],
    new150: ["增加课程表查询", "成绩查询增加 GPA (平均绩点)查询", "在 GitHub 上开放源代码 (仅小程序，服务器源码将在未来开放)", "优化冷启动数据加载逻辑", "提高验证码识别准确率", "课程表提供手动刷新操作", "修复一些不可感知 bug"]
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {
    wx.stopPullDownRefresh()
  }
})