// pages/WhatsNew/WhatsNew.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    new185: ["做了一些清理", "修复几处遗留问题"],
    new183: ["相同的课程表使用相同的颜色显示", "稍微修改了课程表显示方式（需重新获取课程表并重启小程序）", "常规修复"],
    new180: ["增加广告显示，具体信息请查看“关于”页面", "修复 iPad 课程表显示不正常", "课程表左上角增加当前周数显示", "增加服务器状态显示", "修改登录提示", "取消下拉刷新成绩", "UI 调整"],
    new170: ["调整登录方式为个人门户，请及时更新信息", "修复挂科成绩无法显示的 bug", "账号设置页面增加测试登录按钮", "提升信息获取速度", "逻辑优化", "UI 调整"],
    new160: ["优化课程表显示", "调整打开分享逻辑", "点击课程可以显示时间重复的课程（滑动查看）", "UI 调整"],
    new155: ["调整打开分享卡片的逻辑", "修复一个恶性 bug", "修复加载数据时逻辑错误"],
    new153: ["增加客服入口", "可通过右上角进行转发操作", "冷启动时主动检查更新", "UI 调整"],
    new150: ["增加课程表查询", "成绩查询增加 GPA (平均绩点)查询", "在 GitHub 上开放源代码 (仅小程序，服务器源码将在未来开放)", "优化冷启动数据加载逻辑", "提高验证码识别准确率", "课程表提供手动刷新操作", "修复一些不可感知 bug"]
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function(options) {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function() {
    wx.stopPullDownRefresh()
  }
})